# Brewfile - declarative Homebrew install manifest.
# Apply with: brew bundle --file=Brewfile  (or `rebuild`).
# Upgrade with: brew bundle --upgrade --file=Brewfile  (or `update --deps`).
# Cleanup unused: brew bundle cleanup --file=Brewfile  (manual).

# =============================================================================
# Taps
# =============================================================================
tap "oneleet/tap"
tap "julienandreu/tap"

# =============================================================================
# Core CLI tools
# =============================================================================
brew "git"
brew "gh"
brew "awscli"
brew "neovim"
brew "starship"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

# =============================================================================
# Search, navigation, formatting (Rust-based CLI replacements)
# =============================================================================
brew "ripgrep"        # rg - grep replacement
brew "fd"             # find replacement
brew "fzf"            # fuzzy finder
brew "jq"             # JSON processor
brew "zoxide"         # smarter cd
brew "dust"           # du - visual disk usage
brew "sd"             # sed - simpler find & replace
brew "procs"          # ps - colored process tables
brew "git-delta"      # syntax-highlighted git diffs (delta)
brew "just"           # make - command runner
brew "hyperfine"      # time - benchmarking
brew "xh"             # curl alternative
brew "eza"            # ls replacement
brew "bat"            # cat replacement
brew "bottom"         # top replacement (btm)
brew "tealdeer"       # tldr pages

# =============================================================================
# Programming languages & runtimes
# =============================================================================
brew "fnm"            # Node version manager (~150x faster than nvm)
brew "rust"           # rustc + cargo
brew "rust-analyzer"
brew "python@3.13"
brew "ruff"           # Python linter/formatter
brew "pipx"           # isolated Python CLI installs
brew "uv"             # fast Python package + venv manager

# =============================================================================
# Development tools
# =============================================================================
brew "docker-compose"
brew "terraform"
brew "displayplacer"  # CLI display resolution
brew "git-sweep"      # branch cleanup

# =============================================================================
# macOS preferences plumbing (used by bin/macos-defaults.sh)
# =============================================================================
brew "dockutil"       # declarative dock persistent-apps

# =============================================================================
# GUI applications
# =============================================================================
cask "1password"
cask "cursor"
cask "docker-desktop"
cask "ghostty"
cask "google-chrome"
cask "karabiner-elements"
cask "linear-linear"
cask "oneleet-agent"
cask "slack"

# =============================================================================
# Fonts
# =============================================================================
cask "font-meslo-lg-nerd-font"
